[{"title": "6 Things to Know About NASA's Ingenuity Mars Helicopter", "preview": "The first helicopter attempting to fly on another planet is a marvel of engineering. Get up to speed with these key facts about its plans."}, {"title": "Mars Is Getting a New Robotic Meteorologist", "preview": "Sensors on NASA's Perseverance will help prepare for future human exploration by taking weather measurements and studying dust particles."}, {"title": "A Martian Roundtrip: NASA's Perseverance Rover Sample Tubes", "preview": "Marvels of engineering, the rover's sample tubes must be tough enough to safely bring Red Planet samples on the long journey back to Earth in immaculate condition. "}, {"title": "Common Questions about InSight's 'Mole'", "preview": "The following Q&As with members of the team answer some of the most common questions about the burrowing device, part of a science instrument called the Heat Flow and Physical Properties Package (HP3)."}, {"title": "MAVEN Maps Electric Currents around Mars that are Fundamental to Atmospheric Loss", "preview": "Five years after NASA’s MAVEN spacecraft entered into orbit around Mars, data from the mission has led to the creation of a map of electric current systems in the Martian atmosphere."}, {"title": "7 Things to Know About the Mars 2020 Perseverance Rover Mission", "preview": "NASA's next rover to the Red Planet is slated to launch no earlier than July 30. These highlights will get you up to speed on the ambitious mission."}, {"title": "NASA Prepares for Moon and Mars With New Addition to Its Deep Space Network", "preview": "Robotic spacecraft will be able to communicate with the dish using radio waves and lasers."}, {"title": "NASA Wins 4 Webbys, 4 People's Voice Awards", "preview": "Winners include the JPL-managed \"Send Your Name to Mars\" campaign, NASA's Global Climate Change website and Solar System Interactive."}, {"title": "Media Get a Close-Up of NASA's Mars 2020 Rover", "preview": "The clean room at NASA's Jet Propulsion Laboratory was open to the media to see NASA's next Mars explorer before it leaves for Florida in preparation for a summertime launch."}, {"title": "Space History Is Made in This NASA Robot Factory", "preview": "From rockets to rovers, JPL's Spacecraft Assembly Facility has been at the center of robotic spaceflight. Here's a closer look at what makes it so special."}, {"title": "NASA's New Mars Rover Is Ready for Space Lasers", "preview": "Perseverance is one of a few Mars spacecraft carrying laser retroreflectors. The devices could provide new science and safer Mars landings in the future."}, {"title": "NASA Updates Mars 2020 Mission Environmental Review", "preview": "NASA and the Department of Energy have completed a more detailed risk analysis for the Mars 2020 rover launch from Florida."}, {"title": "NASA's InSight Flexes Its Arm While Its 'Mole' Hits Pause", "preview": "Now that the lander's robotic arm has helped the mole get underground, it will resume science activities that have been on hold."}, {"title": "Mars InSight Lander to Push on Top of the 'Mole'", "preview": "Engineers have a plan for pushing down on the heat probe, which has been stuck at the Martian surface for a year."}, {"title": "Scientists Explore Outback as Testbed for Mars ", "preview": "Australia provides a great place for NASA's Mars 2020 and the ESA-Roscosmos ExoMars scientists to hone techniques in preparation for searching for signs ancient life on Mars."}]